import Layout from './Layout';
import Home from './Home';
import { Route, Routes } from 'react-router-dom';

function App() {
  const text1 =
    '\n Ден след ден аз се моля \n Аз на тебе се моля, живот \n Дари ме със капчица воля \n Недей ми отнема единствен урок \n\n За тб аз се моля \n Тъгувам и пея, живея \n Но нима съм само в роля \n А не тази истинска, приказна фея \n\n Удари ме отново \n Накажи ме със своя закон справедлив \n Ще стана. Ще бъда сурова \n Но с много любов. Съблечена в стих';
  const text2 =
    '\n Щастие ти мое. \n Мое мило златно щастие. \n Пак ли се търкаля във порои... \n Пак ли ме забрави. Как са там захласите? \n\n Но знам каква е пролетта. \n Знам! Усещам, че ще бъде пролет! \n По-красива от звезда!  \n По-сияйна и отново. Аз се моля...  \n\n Беше тихо. Беше нежно.  \n Беше толкова спокойно. А в живота...  \n Нищо не е безнадеждно.  \n Падаш, ставаш, тичаш. Хващаш днешната посока.';
  const text3 =
    '\n И така вървим полека \n Ей така се смее и света \n Уж проправя ти пътека \nТуко-виж те хванал за носа \n\n А пък ти вървиш полека  \n Виждам пак се смееш на света  \n И не вярваш, че е леко \n Но вървиш, вървиш. Ура! \n\n А цъфти отново всяка пролет \n И умира всеки светъл и прекрасен ден \n Ражда се красив, отворен \n А човекът пак върви. Но леко уморен';
  const date = new Date();
  const poetries = [
    {
      id: 1,
      title: '',
      content: text1,
      date: date,
    },
    {
      id: 2,
      title: '',
      content: text2,
      date: date,
    },
    {
      id: 3,
      title: '',
      content: text3,
      date: date,
    },
  ];

  return (
    <Routes>
      <Route path='/' element={<Layout />}>
        <Route index element={<Home poetries={poetries} />} />
      </Route>
    </Routes>
  );
}

export default App;
